app/controllers/survivors_controller.rb

  def index
    @survivors = Survivor.all
---
SELECT "survivors".* FROM "survivors"