app/models/survivor.rb

  scope :get_all_survivors_data, -> {
    @survivors = Survivor.all
---
SELECT "survivors".* FROM "survivors"